In [3]:
%matplotlib inline

import matplotlib.pyplot as plt
import pandas as pd

In [39]:
#load files and check contents

citydata_df = pd.read_csv('./resources/city_data.csv')
ridedata_df = pd.read_csv('./resources/ride_data.csv')
display(citydata_df.tail(), ridedata_df.tail())

                city  driver_count   type
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

                 city                 date   fare        ride_id
2370      Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371  Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372      North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373     West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374       Newtonview  2019-04-25 10:20:13  55.84  9990581345298

In [40]:
#inspect city data

display(citydata_df.isna().sum())
display(citydata_df.dtypes)

city            0
driver_count    0
type            0
dtype: int64

city            object
driver_count     int64
type            object
dtype: object

In [41]:
citydata_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [42]:
display(sum(citydata_df["type"]=="Urban"))
display(sum(citydata_df['type']=="Suburban"))
display(sum(citydata_df['type']=='Rural'))

66

36

18

In [43]:
#Inspect ride data

ridedata_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [44]:
ridedata_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [45]:
ridedata_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [46]:
pyber_data_df = pd.merge(ridedata_df, citydata_df, how='left', on=['city', 'city'])
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

## Building the Data subsets to Chart

In [53]:
# Urban Cities Df

urban_cities_df = pyber_data_df[pyber_data_df['type'] == 'Urban']
suburban_cities_df = pyber_data_df[pyber_data_df['type'] == 'Suburban']
rural_cities_df = pyber_data_df[pyber_data_df['type'] == 'Rural']
display(urban_cities_df.head(), suburban_cities_df.head(), rural_cities_df.head())

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,2019-01-27 03:08:01,27.79,6653622887913,11,Suburban
1626,East Kentstad,2019-04-07 19:44:19,18.75,6575961095852,20,Suburban
1627,Lake Omar,2019-01-17 21:33:35,21.71,966911700371,22,Suburban
1628,Myersshire,2019-02-27 17:38:39,17.10,5706770909868,19,Suburban
1629,West Hannah,2019-04-19 01:06:59,37.78,2273047151891,12,Suburban

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,2019-04-13 11:13:31,43.22,1076079536213,9,Rural
2251,North Holly,2019-02-02 14:54:00,12.42,1985256326182,8,Rural
2252,Michaelberg,2019-03-27 18:27:34,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2019-02-23 21:12:24,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,2019-05-06 08:57:56,51.80,4018025271936,2,Rural

In [57]:
urban_ride_count = urban_cities_df.groupby(['city']).count()['ride_id']
suburban_ride_count = suburban_cities_df.groupby(['city']).count()['ride_id']
rural_ride_count = rural_cities_df.groupby(['city']).count()['ride_id']
display(urban_ride_count.head(), suburban_ride_count.head(), rural_ride_count.head())

city
Amandaburgh        18
Barajasview        22
Carriemouth        27
Christopherfurt    27
Deanville          19
Name: ride_id, dtype: int64

city
Barronchester    16
Bethanyland      18
Brandonfort      19
Colemanland      22
Davidfurt        17
Name: ride_id, dtype: int64

city
Bradshawfurt      10
Garzaport          3
Harringtonfort     6
Jessicaport        6
Lake Jamie         6
Name: ride_id, dtype: int64